In [1]:
%load_ext sql

In [2]:
%sql postgresql://student:student@127.0.0.1/sparkifydb

'Connected: student@sparkifydb'

#Check Monhtly Counts to check absend days

In [14]:
%sql SELECT t.month, t.day, count(*) FROM songplays as s JOIN time as t ON s.start_time = t.start_time WHERE t.year=2018 GROUP BY t.month, t.day ORDER BY 1 desc,2 desc;

 * postgresql://student:***@127.0.0.1/sparkifydb
30 rows affected.

[(11, 30, 330),
 (11, 29, 319),
 (11, 28, 363),
 (11, 27, 256),
 (11, 26, 216),
 (11, 25, 41),
 (11, 24, 314),
 (11, 23, 239),
 (11, 22, 82),
 (11, 21, 437),
 (11, 20, 322),
 (11, 19, 276),
 (11, 18, 138),
 (11, 17, 127),
 (11, 16, 319),
 (11, 15, 479),
 (11, 14, 390),
 (11, 13, 339),
 (11, 12, 166),
 (11, 11, 73),
 (11, 10, 87),
 (11, 9, 252),
 (11, 8, 161),
 (11, 7, 174),
 (11, 6, 154),
 (11, 5, 356),
 (11, 4, 144),
 (11, 3, 100),
 (11, 2, 155),
 (11, 1, 11)]

#Check Tables Number Of Rowa

In [40]:
%sql SELECT 'SongPlays' Table_Name, count(*) as Total_Cnt FROM songplays UNION SELECT 'Users' Table_Name, count(*) as Total_Cnt FROM users UNION SELECT 'Songs' Table_Name, count(*) as Total_Cnt FROM songs UNION SELECT 'Artists' Table_Name, count(*) as Total_Cnt FROM artists UNION SELECT 'Time' Table_Name, count(*) as Total_Cnt FROM time;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('Songs', 71),
 ('Artists', 69),
 ('Users', 96),
 ('Time', 6813),
 ('SongPlays', 6820)]